# Manipulando dados com Pandas, Polars e PySpark
Escrito por Rafael Ribeiro de Lima. Linkedin: https://www.linkedin.com/in/rafarlima/

O Objetivo desse hands-on é fazer uma breve introdução das bibliotecas Pandas, Polars e PySpark e passar os principais comandos de cada uma.

## 0. Instalação / Configuração

In [ ]:
# !pip install polars

In [ ]:
# !pip install pandas

In [ ]:
# !pip install pyspark

In [ ]:
# !pip install findspark

## 1. Imports Necessários

In [2]:
import findspark
findspark.init()

import pandas as pd
import polars as pl
from pyspark.sql import SparkSession

import numpy as np

## 2. Inicialização Spark

In [3]:
# Inicializando ums Sessão Spark
spark = SparkSession.builder.appName("NomeDoAplicativo").getOrCreate()

c:\users\rafael\appdata\local\programs\python\python37\lib\site-packages\pyspark\context.py:317: FutureWarning: Python 3.7 support is deprecated in Spark 3.4.
  warnings.warn("Python 3.7 support is deprecated in Spark 3.4.", FutureWarning)

## 3. Leitura CSV

In [4]:
%%time
df_pd = pd.read_csv('./datasets/train.csv')

Wall time: 21.7 ms

In [5]:
%%time
df_pl = pl.read_csv('./datasets/train.csv')

Wall time: 123 ms

In [6]:
%%time
df_ps = spark.read.csv("./datasets/train.csv", header=True, inferSchema=True)

Wall time: 8.05 s

## 4. Criando Dataframes

In [7]:
data = [("Alice", 28), ("Bob", None), ("Charlie", 31), ("David", 25)]
columns = ["Name", "Age"]

In [8]:
df_pd = pd.DataFrame(data=data,columns=columns)

In [9]:
df_pl = pl.DataFrame(data, schema=columns)

In [10]:
df_ps = spark.createDataFrame(data).toDF(*columns)

## 5. Exibindo as 5 primeiras Linhas

In [11]:
%%time
df_pd.head()

Wall time: 0 ns

      Name   Age
0    Alice  28.0
1      Bob   NaN
2  Charlie  31.0
3    David  25.0

In [12]:
%%time
df_pl.head()

Wall time: 0 ns

shape: (4, 2)
┌─────────┬──────┐
│ Name    ┆ Age  │
│ ---     ┆ ---  │
│ str     ┆ i64  │
╞═════════╪══════╡
│ Alice   ┆ 28   │
│ Bob     ┆ null │
│ Charlie ┆ 31   │
│ David   ┆ 25   │
└─────────┴──────┘

In [13]:
%%time
df_ps.show()

+-------+----+
|   Name| Age|
+-------+----+
|  Alice|  28|
|    Bob|null|
|Charlie|  31|
|  David|  25|
+-------+----+

Wall time: 5.01 s

## 6. Dimensões

In [14]:
df_pd.shape

(4, 2)

In [15]:
df_pl.shape

(4, 2)

In [16]:
print((df_ps.count(), len(df_ps.columns)))

(4, 2)

## 7. Datatype

In [17]:
df_pd.dtypes

Name     object
Age     float64
dtype: object

In [18]:
df_pl.dtypes

[Utf8, Int64]

In [19]:
df_ps.dtypes

[('Name', 'string'), ('Age', 'bigint')]

## 8. Selecionando colunas(s)

In [20]:
df_pd[['Name']]

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [21]:
df_pl[['Name']]

shape: (4, 1)
┌─────────┐
│ Name    │
│ ---     │
│ str     │
╞═════════╡
│ Alice   │
│ Bob     │
│ Charlie │
│ David   │
└─────────┘

In [22]:
df_ps.select("Name").show()

+-------+
|   Name|
+-------+
|  Alice|
|    Bob|
|Charlie|
|  David|
+-------+

## 9. Filtrando Dados

In [23]:
df_pd[df_pd.Age > 22]

      Name   Age
0    Alice  28.0
2  Charlie  31.0
3    David  25.0

In [24]:
df_pl.filter(pl.col("Age") >22)

shape: (3, 2)
┌─────────┬─────┐
│ Name    ┆ Age │
│ ---     ┆ --- │
│ str     ┆ i64 │
╞═════════╪═════╡
│ Alice   ┆ 28  │
│ Charlie ┆ 31  │
│ David   ┆ 25  │
└─────────┴─────┘

In [25]:
df_ps.filter(df_ps.Age > 22).show()

+-------+---+
|   Name|Age|
+-------+---+
|  Alice| 28|
|Charlie| 31|
|  David| 25|
+-------+---+

## 10. Ordenando

In [26]:
df_pd.sort_values('Age')

      Name   Age
3    David  25.0
0    Alice  28.0
2  Charlie  31.0
1      Bob   NaN

In [27]:
df_pl.sort('Age')

shape: (4, 2)
┌─────────┬──────┐
│ Name    ┆ Age  │
│ ---     ┆ ---  │
│ str     ┆ i64  │
╞═════════╪══════╡
│ Bob     ┆ null │
│ David   ┆ 25   │
│ Alice   ┆ 28   │
│ Charlie ┆ 31   │
└─────────┴──────┘

In [28]:
df_ps.orderBy("Age").show()

+-------+----+
|   Name| Age|
+-------+----+
|    Bob|null|
|  David|  25|
|  Alice|  28|
|Charlie|  31|
+-------+----+

## 11. Preenchendo valores nulos

In [29]:
df_pd['Age'] = df_pd.Age.fillna(22)
df_pd.head()

      Name   Age
0    Alice  28.0
1      Bob  22.0
2  Charlie  31.0
3    David  25.0

In [30]:
df_pl = df_pl.with_columns(df_pl['Age'].fill_null(22))
df_pl.head()

shape: (4, 2)
┌─────────┬─────┐
│ Name    ┆ Age │
│ ---     ┆ --- │
│ str     ┆ i64 │
╞═════════╪═════╡
│ Alice   ┆ 28  │
│ Bob     ┆ 22  │
│ Charlie ┆ 31  │
│ David   ┆ 25  │
└─────────┴─────┘

In [31]:
from pyspark.sql.functions import when
df_ps = df_ps.withColumn("Age", when(df_ps["Age"].isNull(), 22).otherwise(df_ps["Age"]))
df_ps.show()

+-------+---+
|   Name|Age|
+-------+---+
|  Alice| 28|
|    Bob| 22|
|Charlie| 31|
|  David| 25|
+-------+---+

## 12. Concatenação

In [32]:
data = [("Ana", 40)]
columns = ["Name", "Age"]
df_pd1 = pd.DataFrame(data=data,columns=columns)
df_pl1 = pl.DataFrame(data, schema=columns)
df_ps1 = spark.createDataFrame(data).toDF(*columns)

In [33]:
df_pd = pd.concat([df_pd,df_pd1])
df_pd.head()

      Name   Age
0    Alice  28.0
1      Bob  22.0
2  Charlie  31.0
3    David  25.0
0      Ana  40.0

In [34]:
df_pl = pl.concat([df_pl,df_pl1])
df_pl.head()

shape: (5, 2)
┌─────────┬─────┐
│ Name    ┆ Age │
│ ---     ┆ --- │
│ str     ┆ i64 │
╞═════════╪═════╡
│ Alice   ┆ 28  │
│ Bob     ┆ 22  │
│ Charlie ┆ 31  │
│ David   ┆ 25  │
│ Ana     ┆ 40  │
└─────────┴─────┘

In [35]:
df_ps = df_ps.union(df_ps1)
df_ps.show()

+-------+---+
|   Name|Age|
+-------+---+
|  Alice| 28|
|    Bob| 22|
|Charlie| 31|
|  David| 25|
|    Ana| 40|
+-------+---+

## 13. Inner Join

In [36]:
data = [("Ana", "F"),("Alice", "F"),("Bob", "M"),("Charlie", "M"),("David", "M")]
columns = ["Name", "Gender"]
df_pd2 = pd.DataFrame(data=data,columns=columns)
df_pl2 = pl.DataFrame(data, schema=columns)
df_ps2 = spark.createDataFrame(data).toDF(*columns)

In [37]:
df_pd = pd.merge(df_pd,df_pd2, on='Name', how='inner')
df_pd.head()

      Name   Age Gender
0    Alice  28.0      F
1      Bob  22.0      M
2  Charlie  31.0      M
3    David  25.0      M
4      Ana  40.0      F

In [38]:
df_pl = df_pl.join(df_pl2, on='Name', how='inner')
df_pl.head()

shape: (5, 3)
┌─────────┬─────┬────────┐
│ Name    ┆ Age ┆ Gender │
│ ---     ┆ --- ┆ ---    │
│ str     ┆ i64 ┆ str    │
╞═════════╪═════╪════════╡
│ Ana     ┆ 40  ┆ F      │
│ Alice   ┆ 28  ┆ F      │
│ Bob     ┆ 22  ┆ M      │
│ Charlie ┆ 31  ┆ M      │
│ David   ┆ 25  ┆ M      │
└─────────┴─────┴────────┘

In [39]:
df_ps = df_ps.join(df_ps2, on='Name', how='inner')
df_ps.show()

+-------+---+------+
|   Name|Age|Gender|
+-------+---+------+
|  Alice| 28|     F|
|    Ana| 40|     F|
|    Bob| 22|     M|
|Charlie| 31|     M|
|  David| 25|     M|
+-------+---+------+

## 14. Agrupamento

In [40]:
df_pd.groupby('Gender').agg(['min','max','mean','median'])

         Age
         min   max  mean median
Gender
F       28.0  40.0  34.0   34.0
M       22.0  31.0  26.0   25.0

In [41]:
df_pl.groupby('Gender').agg([
    pl.col("Age").min().alias("min_age"),
    pl.col("Age").max().alias("max_age"),
    pl.col("Age").mean().alias("mean_age"),
    pl.col("Age").median().alias("median_age")
])

shape: (2, 5)
┌────────┬─────────┬─────────┬──────────┬────────────┐
│ Gender ┆ min_age ┆ max_age ┆ mean_age ┆ median_age │
│ ---    ┆ ---     ┆ ---     ┆ ---      ┆ ---        │
│ str    ┆ i64     ┆ i64     ┆ f64      ┆ f64        │
╞════════╪═════════╪═════════╪══════════╪════════════╡
│ M      ┆ 22      ┆ 31      ┆ 26.0     ┆ 25.0       │
│ F      ┆ 28      ┆ 40      ┆ 34.0     ┆ 34.0       │
└────────┴─────────┴─────────┴──────────┴────────────┘

In [42]:
from pyspark.sql.functions import min, max, mean, median
df_ps.groupBy('Gender').agg(
    min('Age').alias('min_age'),
    max('Age').alias('max_age'),
    mean('Age').alias('mean_age'),
    median('Age').alias('median_age')
).show()

+------+-------+-------+--------+----------+
|Gender|min_age|max_age|mean_age|median_age|
+------+-------+-------+--------+----------+
|     F|     28|     40|    34.0|      34.0|
|     M|     22|     31|    26.0|      25.0|
+------+-------+-------+--------+----------+

## 15. Valores Únicos

In [43]:
df_pd.Name.unique()

array(['Alice', 'Bob', 'Charlie', 'David', 'Ana'], dtype=object)

In [44]:
df_pl['Name'].unique()

shape: (5,)
Series: 'Name' [str]
[
	"Bob"
	"Charlie"
	"Ana"
	"Alice"
	"David"
]

In [45]:
df_ps.select("Name").distinct().show()

+-------+
|   Name|
+-------+
|  Alice|
|    Ana|
|    Bob|
|Charlie|
|  David|
+-------+

## 16. Renomeando colunas

In [46]:
df_pd.rename(columns = {'Name':'Nome', 'Age':'Idade'})

      Nome  Idade Gender
0    Alice   28.0      F
1      Bob   22.0      M
2  Charlie   31.0      M
3    David   25.0      M
4      Ana   40.0      F

In [47]:
df_pl.rename({'Name':'Nome', 'Age':'Idade'})

shape: (5, 3)
┌─────────┬───────┬────────┐
│ Nome    ┆ Idade ┆ Gender │
│ ---     ┆ ---   ┆ ---    │
│ str     ┆ i64   ┆ str    │
╞═════════╪═══════╪════════╡
│ Ana     ┆ 40    ┆ F      │
│ Alice   ┆ 28    ┆ F      │
│ Bob     ┆ 22    ┆ M      │
│ Charlie ┆ 31    ┆ M      │
│ David   ┆ 25    ┆ M      │
└─────────┴───────┴────────┘

In [48]:
df_ps.selectExpr("Name as Nome", "Age as Idade").show()

+-------+-----+
|   Nome|Idade|
+-------+-----+
|  Alice|   28|
|    Ana|   40|
|    Bob|   22|
|Charlie|   31|
|  David|   25|
+-------+-----+

## 17. Deletando Colunas

In [49]:
df_pd.drop(columns = ['Age'])

      Name Gender
0    Alice      F
1      Bob      M
2  Charlie      M
3    David      M
4      Ana      F

In [50]:
df_pl.drop(['Age'])

shape: (5, 2)
┌─────────┬────────┐
│ Name    ┆ Gender │
│ ---     ┆ ---    │
│ str     ┆ str    │
╞═════════╪════════╡
│ Ana     ┆ F      │
│ Alice   ┆ F      │
│ Bob     ┆ M      │
│ Charlie ┆ M      │
│ David   ┆ M      │
└─────────┴────────┘

In [51]:
df_ps.drop("Age").show()

+-------+------+
|   Name|Gender|
+-------+------+
|  Alice|     F|
|    Ana|     F|
|    Bob|     M|
|Charlie|     M|
|  David|     M|
+-------+------+

## 19. Convertendo DataFrame PySpark Pandas

In [52]:
# converte dataframe para o pandas
dfpandas = df_ps.toPandas()
dfpandas.head()

      Name  Age Gender
0    Alice   28      F
1      Ana   40      F
2      Bob   22      M
3  Charlie   31      M
4    David   25      M

In [53]:
# converte dataframe pandas para spark novamente
dfspark = spark.createDataFrame(dfpandas)
dfspark.show()

+-------+---+------+
|   Name|Age|Gender|
+-------+---+------+
|  Alice| 28|     F|
|    Ana| 40|     F|
|    Bob| 22|     M|
|Charlie| 31|     M|
|  David| 25|     M|
+-------+---+------+

## 20. Encerrando a Sessão Spark

In [54]:
spark.stop()